Tekla Open API Reference for Tekla Structures 2025
DetailMarkTagsAttributes Constructor (ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes, ViewMarkBasicTagAttributes)
 Creates a new mark tags attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DetailMarkTagsAttributes(
	ViewMarkBasicTagAttributes tagA1,
	ViewMarkBasicTagAttributes tagA2,
	ViewMarkBasicTagAttributes tagA3,
	ViewMarkBasicTagAttributes tagA4,
	ViewMarkBasicTagAttributes tagA5
)
Public Sub New (
	tagA1 As ViewMarkBasicTagAttributes,
	tagA2 As ViewMarkBasicTagAttributes,
	tagA3 As ViewMarkBasicTagAttributes,
	tagA4 As ViewMarkBasicTagAttributes,
	tagA5 As ViewMarkBasicTagAttributes
)
Parameters
tagA1
Type: Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
The tag at place A1.
tagA2
Type: Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
The tag at place A2.
tagA3
Type: Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
The tag at place A3.
tagA4
Type: Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
The tag at place A4.
tagA5
Type: Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
The tag at place A5.
See Also
Reference
DetailMarkTagsAttributes Class
DetailMarkTagsAttributes Overload
Tekla.Structures.Drawing Namespace